Repository: AChep/keyguard-app
Catalog: appleUi/Sources/KeyguardUI/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, hu, it, ja, ko, pt_br, pt_pt, ru, uk, zh_hans

# generator_passphrase_type
source: Passphrase
ar: عبارة المرور
es: Frase de contraseña
fr: Phrase de passe
hu: Jelmondat
it: Frase d'accesso
ja: パスフレーズ
ko: 비밀 문구
pt_br: Frase Secreta
pt_pt: Frase-palavra-passe
ru: Парольная фраза
uk: Парольна фраза
zh_hans: 口令

# generator_passphrase_wordlist_title
source: Wordlist
ar: قائمة الكلمات
de: Wortliste
es: Lista de palabras
fr: Liste de mots
hu: Szólista
it: Lista di parole
ja: ワードリスト
ko: 단어 목록
pt_br: Lista de Palavras
pt_pt: Lista de palavras
ru: Список слов
uk: Список слів
zh_hans: 词表

# generator_password_exclude_ambiguous_symbols_title
source: Exclude ambiguous symbols
ar: استبعاد الرموز الغامضة
de: Mehrdeutige Symbole ausschließen
es: Excluir símbolos ambiguos
fr: Exclure les symboles ambigus
hu: Zavaró szimbólumok kizárása
it: Evita simboli ambigui
ja: あいまいな文字を除外
ko: 알아보기 힘든 문자 제외
pt_br: Excluir símbolos ambíguos
pt_pt: Excluir símbolos ambíguos
ru: Исключить неоднозначные символы
uk: Виключити неоднозначні символи
zh_hans: 排除不明确的符号

# generator_password_exclude_similar_symbols_title
source: Exclude similar symbols
ar: استبعاد الرموز المماثلة
de: Ähnliche Symbole ausschließen
es: Excluir símbolos similares
fr: Exclure les symboles similaires
hu: Hasonló szimbólumok kizárása
it: Evita simboli simili
ja: 類似した文字を除外
ko: 비슷한 문자 제외
pt_br: Excluir símbolos semelhantes
pt_pt: Excluir símbolos semelhantes
ru: Исключить похожие символы
uk: Виключити подібні символи
zh_hans: 排除易混淆的符号

# generator_password_history_title
source: Password history
ar: تاريخ كلمة المرور
de: Passwortverlauf
es: Historial de contraseñas
fr: Historique des mots de passe
hu: Jelszó előzmények
it: Cronologia della password
ja: パスワードの履歴
ko: 비밀번호 생성 기록
pt_br: Histórico de senhas
pt_pt: Histórico de palavras-passe
ru: История паролей
uk: Історія паролів
zh_hans: 生成密码历史记录

# generator_password_lowercase_letters_title
source: Lowercase letters
ar: الحروف الصغيرة
de: Kleinbuchstaben
es: Letras minúsculas
fr: Minuscules
hu: Kisbetűk
it: Lettere minuscole
ja: 小文字
ko: 소문자
pt_br: Letras minúsculas
pt_pt: Letras minúsculas
ru: Строчные буквы
uk: Малі літери
zh_hans: 小写字母

# generator_password_numbers_title
source: Digits
ar: أرقام
de: Ziffern
es: Dígitos
fr: Chiffres
hu: Számjegyek
it: Numeri
ja: 数字
ko: 숫자
pt_br: Dígitos
pt_pt: Números
ru: Цифры
uk: Цифри
zh_hans: 位数

# generator_password_symbols_title
source: Symbols
ar: الرموز
de: Symbole
es: Símbolos
fr: Caractères spéciaux
hu: Szimbólumok
it: Simboli
ja: 記号
ko: 기호
pt_br: Símbolos
pt_pt: Símbolos
ru: Спец. символы
uk: Символи
zh_hans: 符号

# generator_password_type
source: Random symbols
ar: رموز عشوائية
de: Zufällige Symbole
es: Símbolos aleatorios
fr: Symboles aléatoires
hu: Véletlenszerű szimbólumok
it: Simboli casuali
ja: ランダムな文字
ko: 무작위 비밀번호
pt_br: Símbolos aleatórios
pt_pt: Caracteres aleatórios
ru: Случайные символы
uk: Випадкові символи
zh_hans: 随机符号

# generator_password_uppercase_letters_title
source: Uppercase letters
ar: الحروف الكبيرة
de: Großbuchstaben
es: Letras mayúsculas
fr: Majuscules
hu: Nagybetűk
it: Lettere maiuscole
ja: 大文字
ko: 대문자
pt_br: Letras maiúsculas
pt_pt: Letras maiúsculas
ru: Заглавные буквы
uk: Великі літери
zh_hans: 大写字母

# generator_pin_code_note
source: Almost one in 10 people use the same four-digit PIN. Generate PINs to avoid common variants.
ar: يستخدم واحد من كل 10 أشخاص تقريبًا نفس رقم PIN المكون من أربعة أرقام. قم بتوليد أرقام PIN لتجنب الأرقام الشائعة.
de: Fast jede zehnte Person verwendet dieselbe vierstellige PIN. Generieren Sie PINs, um gängige Varianten zu vermeiden.
es: Casi una de cada 10 personas usa el mismo PIN de cuatro dígitos. Genera PIN para evitar variantes comunes.
fr: Près d'une personne sur 10 utilise le même code PIN à quatre chiffres. Générez des codes PIN pour éviter les variantes les plus courantes.
hu: Majdnem minden tizedik ember ugyanazt a négyjegyű PIN kódot használja. Generáljon PIN kódokat a gyakori változatok elkerülése érdekében.
it: Quasi una persona su 10 usa lo stesso PIN a quattro cifre. Genera i PIN per evitare varianti comuni.
ja: 約10人に1人が同じ4桁のPINを使用しています。推測されやすい一般的な番号を避けるために、推測が難しいPINを生成しましょう。
ko: 10명 중 1명꼴로 같은 4자리 PIN을 사용합니다. PIN을 생성하여 사용하면 자주 사용되는 PIN을 피할 수 있습니다.
pt_br: Quase uma em cada 10 pessoas usam o mesmo PIN de quatro dígitos. Gere PINs para evitar variantes comuns.
pt_pt: Quase uma em cada 10 pessoas utiliza o mesmo PIN de quatro dígitos. Gere PINs para evitar variantes comuns.
ru: Примерно 1 к 10 человек используют один и тот же четырехзначный PIN-код. Сгенерируйте PIN-коды, чтобы избежать похожих вариантов.
uk: Майже один із 10 людей використовує один і той же чотиризначний PIN-код. Генеруйте PIN-коди, щоб уникнути поширених варіантів.
zh_hans: 几乎十分之一的人使用同样的四位数 PIN。生成 PIN 以避免常见变体。

# generator_pin_code_type
source: PIN
ar: رمز التمرير (PIN)
fr: Code PIN
ru: PIN-код
uk: PIN-код

# generator_regenerate_button
source: Regenerate
ar: تجديد
de: Neu generieren
es: Regenerar
fr: Regénérer
hu: Újra generálás
it: Rigenera
ja: 再生成
ko: 다시 생성
pt_br: Gerar novamente
pt_pt: Gerar novamente
ru: Перегенерировать
uk: Перегенерувати
zh_hans: 重新生成

# generator_show_tips_title
source: Show tips
ar: عرض النصائح
de: Tipps anzeigen
es: Mostrar sugerencias
fr: Afficher les conseils
hu: Tippek megjelenítése
it: Mostra suggerimenti
ja: ヒントを表示
ko: 팁 보이기
pt_br: Mostrar dicas
pt_pt: Mostrar ajudas
ru: Показать советы
uk: Показувати підказки
zh_hans: 显示提示

# generator_use_button
source: Use
ar: استخدم
de: Verwenden
es: Usar
fr: Utiliser
hu: Használ
it: Usa
ja: 使用
ko: 사용
pt_br: Usar
pt_pt: Utilizar
ru: Использовать
uk: Використати
zh_hans: 使用

# generator_username_capitalize_title
source: Capitalize
ar: الاستفادة من الحروف الكبيرة
de: Großschreibung
es: Mayúsculas
fr: Mettre en majuscules
hu: Nagy kezdőbetű
it: Maiuscolo
ja: 英単語の先頭を大文字にする
ko: 첫 글자를 대문자로
pt_br: Capitalizar
pt_pt: Maiúsculas
ru: Прописные
uk: З великої літери
zh_hans: 大写

# generator_username_custom_word_title
source: Custom word
ar: كلمة مخصصة
de: Benutzerdefiniertes Wort
es: Palabra personalizada
fr: Mot personnalisé
hu: Egyéni szó
it: Parola personalizzata
ja: カスタムワード
ko: 사용자 지정 단어
pt_br: Palavra customizada
pt_pt: Palavra personalizada
ru: Пользовательское слово
uk: Довільне слово
zh_hans: 自定义助记词

# generator_username_delimiter_title
source: Delimiter
ar: محدد
de: Trennzeichen
es: Delimitador
fr: Délimiteur
hu: Elválasztójel
it: Separatore
ja: 区切り文字
ko: 구분 기호
pt_br: Delimitador
pt_pt: Limite de caracteres
ru: Разделитель
uk: Роздільник
zh_hans: 分隔符

# generator_username_number_title
source: Number
ar: رقم
de: Zahlen
es: Número
fr: Numéro
hu: Szám
it: Numero
ja: 数字を含める
ko: 숫자 포함
pt_br: Número
pt_pt: Número
ru: Число
uk: Число
zh_hans: 数字

# generator_username_type
source: Username
ar: اسم المستخدم
de: Benutzername
es: Nombre de usuario
fr: Nom d'utilisateur
hu: Felhasználónév
it: Nome utente
ja: ユーザー名
ko: 사용자 이름
pt_br: Nome de usuário
pt_pt: Nome de utilizador
ru: Имя пользователя
uk: Ім'я користувача
zh_hans: 用户名

# generator_username_wordlist_title
source: Wordlist
ar: قائمة الكلمات
de: Wortliste
es: Lista de palabras
fr: Liste de mots
hu: Szólista
it: Lista di parole
ja: ワードリスト
ko: 단어 목록
pt_br: Lista de Palavras
pt_pt: Lista de palavras
ru: Список слов
uk: Список слів
zh_hans: 单词列表

# generatorhistory_clear_history_confirmation_text
source: This will remove all items from the history.
ar: سيؤدي هذا إلى إزالة جميع العناصر من السجل.
de: Dadurch werden alle Elemente aus dem Verlauf entfernt.
es: Esto eliminará todos los elementos del historial.
fr: Cela supprimera tous les éléments de l'historique.
hu: Ezzel az összes elemet eltávolítja az előzményekből.
it: Questo rimuoverà tutti gli elementi dalla cronologia.
ja: すべてのアイテムが履歴から削除されます
ko: 모든 생성기 기록을 삭제합니다.
pt_br: Isto irá remover todos os itens do histórico.
pt_pt: Isto vai remover todos os dados do histórico.
ru: Все записи из истории будут удалены.
uk: Всі записи з історії будуть видалені.
zh_hans: 这将从历史记录中删除所有条目。

# generatorhistory_clear_history_confirmation_title
source: Clear generator history?
ar: هل تريد محو سجل المولد؟
de: Generatorverlauf löschen?
es: ¿Deseas limpiar el historial del generador?
fr: Effacer l'historique du générateur?
hu: Törli az előzményeket?
it: Svuotare la cronologia del generatore?
ja: 生成履歴を消去しますか？
ko: 생성기 기록을 삭제할까요?
pt_br: Limpar histórico do gerador?
pt_pt: Limpar histórico do gerador?
ru: Очистить историю генератора?
uk: Очистити історію генератора?
zh_hans: 确认清除生成器历史记录？

# generatorhistory_clear_history_title
source: Clear history
ar: مسح التاريخ
de: Verlauf leeren
es: Limpiar el historial
fr: Effacer l'historique
hu: Előzmények törlése
it: Pulisci cronologia
ja: 履歴を消去
ko: 기록 삭제
pt_br: Limpar histórico
pt_pt: Limpar histórico
ru: Очистить историю
uk: Очистити історію
zh_hans: 清除历史记录

# generatorhistory_delete_many_confirmation_title
source: Delete the items from the history?
ar: هل تريد حذف العناصر من السجل؟
de: Elemente aus dem Verlauf löschen?
es: ¿Eliminar los elementos del historial?
fr: Supprimer les éléments de l'historique ?
hu: Törli az elemeket az előzményekből?
it: Eliminare gli elementi dalla cronologia?
ja: 履歴からアイテムを削除しますか？
ko: 항목을 기록에서 삭제할까요?
pt_br: Excluir os itens do histórico?
pt_pt: Apagar as entradas do histórico?
ru: Удалить записи из истории?
uk: Видалити ці записи з історії?
zh_hans: 要从历史中移除这些条目吗？

# generatorhistory_delete_one_confirmation_title
source: Delete the item from the history?
ar: هل تريد حذف العنصر من السجل؟
de: Element aus dem Verlauf löschen?
es: ¿Eliminar el elemento del historial?
fr: Supprimer l'élément de l'historique ?
hu: Törli az elemet az előzményekből?
it: Eliminare l'elemento dalla cronologia?
ja: 履歴からアイテムを削除しますか？
ko: 항목을 기록에서 삭제할까요?
pt_br: Excluir o item do histórico?
pt_pt: Apagar a entrada do histórico?
ru: Удалить запись из истории?
uk: Видалити цей запис з історії?
zh_hans: 确定要从历史中移除该条目吗？

# generatorhistory_header_title
source: Generator history
ar: تاريخ المولدات
de: Generatorverlauf
es: Historial del generador
fr: Historique du générateur
hu: Generátor előzmények
it: Cronologia generatore
ja: 生成履歴
ko: 생성기 기록
pt_br: Histórico do gerador
pt_pt: Histórico do gerador
ru: История генерации
uk: Історія генератора
zh_hans: 生成器历史记录

# generic_name
source: Name
ar: الاسم
es: Nombre
fr: Nom
hu: Név
it: Nome
ja: 名前
ko: 이름
pt_br: Nome
pt_pt: Nome
ru: Название
uk: Назва
zh_hans: 名称

source: GPG agent
ar: وكيل GPG
es: Agente GPG
fr: Agent GPG
it: Agente GPG
ja: GPG エージェント
ko: GPG 에이전트
pt_br: Agente GPG
pt_pt: Agente GPG
ru: GPG-агент
uk: GPG-агент
zh_hans: GPG 代理

# gpg_agent_filters_header_title
source: GPG agent filters
ar: عوامل تصفية وكيل GPG
de: GPG-Agenten-Filter
es: Filtros del agente GPG
fr: Filtres de l'agent GPG
it: Filtri per agente GPG
ja: GPGエージェント フィルタ設定
ko: GPG 에이전트 필터
pt_br: Filtros de agente GPG
pt_pt: Filtros de agentes GPG
ru: Фильтры GPG-агента
uk: Фільтри GPG-агента
zh_hans: GPG 代理过滤器

# gpg_agent_filters_note_save_to_apply
source: Changes apply after you press Save.
ar: تُطبَّق التغييرات بعد الضغط على حفظ.
de: Änderungen werden nach dem Speichern übernommen.
es: Los cambios se aplican después de presionar Guardar.
fr: Les modifications seront appliquées après avoir cliqué sur Enregistrer.
it: Le modifiche vengono applicate dopo aver premuto Salva.
ja: 変更は保存後に適用されます。
ko: 변경 사항은 저장을 누른 후 적용됩니다.
pt_br: As alterações serão aplicadas após você pressionar Salvar.
pt_pt: As alterações serão aplicadas após clicar em guardar.
ru: Изменения вступят в силу после нажатия кнопки "Сохранить".
uk: Зміни застосовуються після натискання кнопки «Зберегти».
zh_hans: 更改将在点击“保存”后生效。

# gpg_agent_history_clear_history_confirmation_text
source: This will remove all GPG agent usage history.
ar: سيؤدي هذا إلى إزالة كل سجل استخدام وكيل GPG.
de: Dadurch wird der gesamte Nutzungsverlauf des GPG-Agenten entfernt.
es: Esto eliminará todo el historial de uso del agente GPG.
fr: Cela supprimera tout l'historique d'utilisation de l'agent GPG.
it: Questo rimuoverà tutta la cronologia di utilizzo dell'agente GPG.
ja: GPGエージェントの使用履歴をすべて削除します。
ko: 모든 GPG 에이전트 사용 기록을 삭제합니다.
pt_br: Isso removerá todo o histórico de uso do agente GPG.
pt_pt: Isto removerá todo o histórico de utilização do agente GPG.
ru: Это удалит всю историю использования GPG-агента.
uk: Це видалить усю історію використання GPG-агента.
zh_hans: 这将删除所有 GPG 代理使用历史记录。

# gpg_agent_history_clear_history_confirmation_title
source: Clear GPG agent history?
ar: مسح سجل وكيل GPG؟
de: GPG-Agenten-Verlauf löschen?
es: ¿Borrar el historial del agente GPG?
fr: Effacer l'historique de l'agent GPG ?
it: Cancellare la cronologia dell'agente GPG?
ja: GPGエージェントの履歴を消去しますか？
ko: GPG 에이전트 기록을 지울까요?
pt_br: Limpar histórico do agente GPG?
pt_pt: Limpar histórico do agente GPG?
ru: Очистить историю GPG-агента?
uk: Очистити історію GPG-агента?
zh_hans: 清除 GPG 代理历史记录？

# gpg_agent_history_clear_history_title
source: Clear history
ar: مسح السجل
de: Verlauf leeren
es: Borrar el historial
fr: Effacer l'historique
it: Cancella cronologia
ja: 履歴を消去
ko: 기록 지우기
pt_br: Limpar histórico
pt_pt: Limpar histórico
ru: Очистить историю
uk: Очистити історію
zh_hans: 清除历史记录

# gpg_agent_history_header_title
source: GPG agent history
ar: سجل وكيل GPG
de: GPG-Agenten-Verlauf
es: Historial del agente GPG
fr: Historique de l'agent GPG
it: Cronologia dell'agente GPG
ja: GPGエージェントの履歴
ko: GPG 에이전트 기록
pt_br: Histórico do agente GPG
pt_pt: Histórico do agente GPG
ru: История GPG-агента
uk: Історія GPG-агента
zh_hans: GPG 代理历史记录

# gpg_agent_history_request_decrypt
source: Decrypt
ar: فك التشفير
de: Entschlüsseln
es: Descifrar
fr: Déchiffrer
it: Decrittografa
ja: 復号
ko: 복호화
pt_br: Descriptografar
pt_pt: Desencriptar
ru: Расшифровка
uk: Розшифрувати
zh_hans: 解密

# gpg_agent_history_request_list_keys
source: List keys
ar: عرض المفاتيح
de: Schlüssel auflisten
es: Listar claves
fr: Lister les clés
it: Elenca chiavi
ja: キーの一覧表示
ko: 키 목록 조회
pt_br: Listar chaves
pt_pt: Listar chaves
ru: Список ключей
uk: Список ключів
zh_hans: 列出密钥

# gpg_agent_history_request_sign_hash
source: Sign hash
ar: توقيع التجزئة
de: Hash signieren
es: Firmar hash
fr: Signer le hash
it: Firma hash
ja: ハッシュの署名
ko: 해시 서명
pt_br: Assinar hash
pt_pt: Assinatura hash
ru: Подпись хэша
uk: Підписати хеш
zh_hans: 签名哈希

# gpg_agent_history_response_failure
source: Failed
ar: فشل
de: Fehlgeschlagen
es: Fallido
fr: Échec
it: Non riuscito
ja: 失敗
ko: 실패
pt_br: Falhou
pt_pt: Falhou
ru: Ошибка
uk: Помилка
zh_hans: 失败

# gpg_agent_history_response_key_not_found
source: Key not found
ar: لم يتم العثور على المفتاح
de: Schlüssel nicht gefunden
es: Clave no encontrada
fr: Clé introuvable
it: Chiave non trovata
ja: キーが見つかりません
ko: 키를 찾을 수 없음
pt_br: Chave não encontrada
pt_pt: Chave não encontrada
ru: Ключ не найден
uk: Ключ не знайдено
zh_hans: 找不到密钥

# gpg_agent_history_response_success
source: Success
ar: نجاح
de: Erfolgreich
es: Correcto
fr: Réussi
it: Riuscito
ja: 成功
ko: 성공
pt_br: Sucesso
pt_pt: Bem-sucedido
ru: Успешно
uk: Успішно
zh_hans: 成功

# gpg_agent_history_response_unsupported
source: Unsupported
ar: غير مدعوم
de: Nicht unterstützt
es: No admitido
fr: Non pris en charge
it: Non supportato
ja: サポートされていません
ko: 지원되지 않음
pt_br: Não suportado
pt_pt: Não suportado
ru: Не поддерживается
uk: Не підтримується
zh_hans: 暂不支持

# gpg_agent_history_response_user_denied
source: Denied
ar: مرفوض
de: Abgelehnt
es: Denegado
fr: Refusé
it: Negato
ja: 拒否されました
ko: 거부됨
pt_br: Negado
pt_pt: Negado
ru: Отклонено
uk: Відхилено
zh_hans: 拒绝

# gpg_agent_history_response_vault_locked
source: Vault locked
ar: الخزنة مقفلة
de: Tresor gesperrt
es: Caja fuerte bloqueada
fr: Coffre-fort verrouillé
it: Cassaforte bloccata
ja: 保管庫がロックされています
ko: 보관함 잠김
pt_br: Cofre bloqueado
pt_pt: O cofre bloqueado
ru: Хранилище заблокировано
uk: Сховище заблоковано
zh_hans: 密码库已锁定

# gpg_agent_history_unknown_caller
source: Unknown caller
ar: متصل غير معروف
de: Unbekannter Aufrufer
es: Solicitante desconocido
fr: Appelant inconnu
it: Chiamante sconosciuto
ja: 不明な呼び出し元
ko: 알 수 없는 호출자
pt_br: Chamador desconhecido
pt_pt: Número desconhecido
ru: Неизвестный источник
uk: Невідомий запитувач
zh_hans: 未知调用方

# gpg_agent_history_unknown_key
source: Unknown key
ar: مفتاح غير معروف
de: Unbekannter Schlüssel
es: Clave desconocida
fr: Clé inconnue
it: Chiave sconosciuta
ja: 不明なキー
ko: 알 수 없는 키
pt_br: Chave desconhecida
pt_pt: Chave desconhecida
ru: Неизвестный ключ
uk: Невідомий ключ
zh_hans: 未知的密钥

# gpg_agent_request_approval_decrypt_message_known_app
source: %1$@ wants to use the following GPG key to decrypt data:
ar: %1$@ يريد استخدام مفتاح GPG التالي لفك تشفير البيانات:
de: %1$@ möchte den folgenden GPG-Schlüssel verwenden, um Daten zu entschlüsseln:
es: %1$@ desea utilizar la siguiente clave GPG para descifrar datos:
fr: %1$@ souhaite utiliser la clé GPG suivante pour déchiffrer les données :
it: %1$@ vuole utilizzare la seguente chiave GPG per decrittografare i dati:
ja: %1$@ が以下の GPG キーを使用してデータの復号を行おうとしています：
ko: %1$@이(가) 데이터를 복호화하기 위해 다음 GPG 키를 사용하려고 합니다:
pt_br: %1$@ deseja usar a seguinte chave GPG para descriptografar dados:
pt_pt: %1$@ pretende utilizar a seguinte chave GPG para desencriptar os dados:
ru: %1$@ хочет использовать следующий GPG-ключ для расшифровки данных:
uk: %1$@ хоче використати цей GPG-ключ для розшифрування даних:
zh_hans: %1$@ 想要使用以下 GPG 密钥解密数据：

# gpg_agent_request_approval_decrypt_message_unknown_app
source: An application wants to use the following GPG key to decrypt data:
ar: يريد تطبيق استخدام مفتاح GPG التالي لفك تشفير البيانات:
de: Eine Anwendung möchte den folgenden GPG-Schlüssel verwenden, um Daten zu entschlüsseln:
es: Una aplicación desea utilizar la siguiente clave GPG para descifrar datos:
fr: Une application souhaite utiliser la clé GPG suivante pour déchiffrer les données :
it: Un'applicazione desidera utilizzare la seguente chiave GPG per decrittografare i dati:
ja: あるアプリケーションが以下の GPG キーを使用してデータの復号を行おうとしています：
ko: 애플리케이션이 데이터를 복호화하기 위해 다음 GPG 키를 사용하려고 합니다:
pt_br: Um aplicativo deseja usar a seguinte chave GPG para descriptografar dados:
pt_pt: Uma aplicação deseja utilizar a seguinte chave GPG para desencriptar dados:
ru: Приложение хочет использовать следующий GPG-ключ для расшифровки данных:
uk: Застосунок хоче використати цей GPG-ключ для розшифрування даних:
zh_hans: 某个应用程序想要使用以下 GPG 密钥解密数据：

# gpg_agent_request_approval_decrypt_title
source: GPG Decryption Request
ar: طلب فك تشفير GPG
de: GPG-Entschlüsselungsanfrage
es: Solicitud de descifrado GPG
fr: Demande de déchiffrement GPG
it: Richiesta di decrittografia GPG
ja: GPG 復号リクエスト
ko: GPG 복호화 요청
pt_br: Solicitação de descriptografia GPG
pt_pt: Pedido de descriptografia GPG
ru: Запрос на расшифровку GPG
uk: Запит на розшифрування GPG
zh_hans: GPG 解密请求

# gpg_agent_request_approval_sign_message_known_app
source: %1$@ wants to use the following GPG key to sign data:
ar: %1$@ يريد استخدام مفتاح GPG التالي لتوقيع البيانات:
de: %1$@ möchte den folgenden GPG-Schlüssel verwenden, um Daten zu signieren:
es: %1$@ desea utilizar la siguiente clave GPG para firmar datos:
fr: %1$@ souhaite utiliser la clé GPG suivante pour signer les données :
it: %1$@ vuole utilizzare la seguente chiave GPG per firmare i dati:
ja: %1$@ が以下の GPG キーを使用してデータの署名を行おうとしています：
ko: %1$@이(가) 데이터를 서명하기 위해 다음 GPG 키를 사용하려고 합니다:
pt_br: %1$@ deseja usar a seguinte chave GPG para assinar dados:
pt_pt: %1$@ pretende utilizar a seguinte chave GPG para assinar dados:
ru: %1$@ хочет использовать следующий GPG-ключ для подписания данных:
uk: %1$@ хоче використати цей GPG-ключ для підпису даних:
zh_hans: %1$@ 想要使用以下 GPG 密钥对数据进行签名：

# gpg_agent_request_approval_sign_message_unknown_app
source: An application wants to use the following GPG key to sign data:
ar: يريد تطبيق استخدام مفتاح GPG التالي لتوقيع البيانات:
de: Eine Anwendung möchte den folgenden GPG-Schlüssel verwenden, um Daten zu signieren:
es: Una aplicación desea utilizar la siguiente clave GPG para firmar datos:
fr: Une application souhaite utiliser la clé GPG suivante pour signer les données :
it: Un'applicazione desidera utilizzare la seguente chiave GPG per firmare i dati:
ja: あるアプリケーションが以下の GPG キーを使用してデータの署名を行おうとしています：
ko: 애플리케이션이 데이터를 서명하기 위해 다음 GPG 키를 사용하려고 합니다:
pt_br: Um aplicativo deseja usar a seguinte chave GPG para assinar dados:
pt_pt: Uma aplicação deseja utilizar a seguinte chave GPG para assinar dados:
ru: Приложение хочет использовать следующий GPG-ключ для подписания данных:
uk: Застосунок хоче використати цей GPG-ключ для підпису даних:
zh_hans: 某个应用程序想要使用以下 GPG 密钥对数据进行签名：

# gpg_agent_request_approval_sign_title
source: GPG Signing Request
ar: طلب توقيع GPG
de: GPG-Signierungsanfrage
es: Solicitud de firma GPG
fr: Demande de signature GPG
it: Richiesta di firma GPG
ja: GPG 署名リクエスト
ko: GPG 서명 요청
pt_br: Solicitação de assinatura GPG
pt_pt: Pedido de assinatura GPG
ru: Запрос на подписание GPG
uk: Запит на підпис GPG
zh_hans: GPG 签名请求

# gpg_agent_setup_header_title
source: GPG client setup
ar: إعداد عميل GPG
de: GPG-Client-Konfiguration
es: Configuración del cliente GPG
fr: Configuration du client GPG
it: Configurazione del client GPG
ja: GPGクライアントのセットアップ
ko: GPG 클라이언트 설정
pt_br: Configuração do cliente GPG
pt_pt: Configuração de cliente GPG
ru: Настройка GPG-клиента
uk: Налаштування GPG-клієнта
zh_hans: GPG 客户端设置

# gpg_agent_setup_intro
source: Set up GnuPG to use Keyguard's GPG agent for signing and decryption without exposing private key material.
ar: أعدّ GnuPG لاستخدام وكيل GPG الخاص بـ Keyguard للتوقيع وفك التشفير دون كشف مادة المفتاح الخاص.
de: Richten Sie GnuPG ein, um den GPG-Agenten von Keyguard zum Signieren und Entschlüsseln zu verwenden, ohne privates Schlüsselmaterial offenzulegen.
es: Configure GnuPG para usar el agente GPG de Keyguard para firmar y descifrar sin exponer material de clave privada.
fr: Configurez GnuPG pour utiliser l'agent GPG de Keyguard pour la signature et le déchiffrement sans exposer de matériel de clé privée.
it: Configura GnuPG per utilizzare l'agente GPG di Keyguard per la firma e la decrittografia senza esporre il materiale della chiave privata.
ja: GnuPG を設定して Keyguard の GPGエージェントを使用すると、秘密鍵の情報を外部に公開することなく、署名や復号を行うことができます。
ko: 개인 키 자료를 노출시키지 않고 서명과 복호화에 Keyguard의 GPG 에이전트를 사용할 수 있게 GnuPG를 설정합니다.
pt_br: Configure o GnuPG para usar o agente GPG do Keyguard para assinatura e descriptografia sem expor material de chave privada.
pt_pt: Configure o GnuPG para utilizar o agente GPG do Keyguard para assinatura e desencriptação sem expor o material da chave privada.
ru: Настройте GnuPG для работы с GPG-агентом Keyguard, чтобы выполнять подписание и расшифровку без раскрытия материалов закрытого ключа.
uk: Налаштуйте GnuPG, щоб використовувати GPG-агент Keyguard для підписування та розшифрування без розкриття даних секретного ключа.
zh_hans: 配置 GnuPG 以使用 Keyguard 的 GPG 代理进行签名和解密，而无需泄露私钥材料。
